#+TITLE: Emacs Configuration
** Settings without corresponding packages
#+BEGIN_SRC emacs-lisp
  (use-package emacs
    :preface
    (defvar malb/indent-width 4)
    :config
    (setq frame-title-format '("Villainous-Emacs")
          ring-bell-function 'ignore
          frame-resize-pixelwise t
          default-directory "~/")

    (tool-bar-mode -1)
    (menu-bar-mode -1)

    (setq-default truncate-lines t)

    ;; better scrolling experience
    (setq scroll-margin 10
          scroll-conservatively 101 ; > 100
          scroll-preserve-screen-position t
          auto-window-vscroll nil)

    ;; Always use spaces for indentation
    (setq-default indent-tabs-mode nil
                  tab-width malb/indent-width)

    ;; Omit default startup screen
    (setq inhibit-startup-screen t))

  ;; Line numbers
  (global-display-line-numbers-mode 1)
  (setq display-line-numbers-type 'relative)
  ;; Disable line numbers for some modes
  (dolist (mode '(org-mode-hook
                  term-mode-hook
                  shell-mode-hook
                  treemacs-mode-hook
                  eshell-mode-hook))

    (add-hook mode (lambda () (display-line-numbers-mode 0))))
  (defalias 'yes-or-no-p 'y-or-n-p)

  (prefer-coding-system 'utf-8)
  (set-default-coding-systems 'utf-8)
  (set-terminal-coding-system 'utf-8)
  (set-keyboard-coding-system 'utf-8)
  ;; backwards compatibility as default-buffer-file-coding-system
  ;; is deprecated in 23.2.
  (if (boundp 'buffer-file-coding-system)
      (setq-default buffer-file-coding-system 'utf-8)
    (setq default-buffer-file-coding-system 'utf-8))

  ;; Treat clipboard input as UTF-8 string first; compound text next, etc.
  (setq x-select-request-type '(UTF8_STRING COMPOUND_TEXT TEXT STRING))
#+END_SRC

#+RESULTS:
| UTF8_STRING | COMPOUND_TEXT | TEXT | STRING |

*** Tramp
#+BEGIN_SRC emacs-lisp
  (require 'tramp)
  (add-to-list 'tramp-remote-path 'tramp-default-remote-path)
  (add-to-list 'tramp-remote-path 'tramp-own-remote-path)
#+END_SRC

#+RESULTS:
| tramp-own-remote-path | tramp-default-remote-path | /bin | /usr/bin | /sbin | /usr/sbin | /usr/local/bin | /usr/local/sbin | /local/bin | /local/freeware/bin | /local/gnu/bin | /usr/freeware/bin | /usr/pkg/bin | /usr/contrib/bin | /opt/bin | /opt/sbin | /opt/local/bin |

*** Auto-pairing quotes and parentheses etc.
Electric-pair-mode has improved quite a bit in recent Emacs versions. No longer need an extra package for this. It also takes care of the new-line-and-push-brace feature.

#+BEGIN_SRC emacs-lisp
  (use-package elec-pair
    :hook (prog-mode . electric-pair-mode))
#+END_SRC

#+RESULTS:
| tempel-setup-capf | electric-pair-mode | editorconfig-major-mode-hook |

*** Clean up whitespace on save
#+BEGIN_SRC emacs-lisp
  (use-package whitespace
    :ensure nil
    :hook (before-save . whitespace-cleanup))
#+END_SRC

#+RESULTS:
| whitespace-cleanup |

*** Dired tweaks
Delete intermediate buffers when navigating through dired.

#+BEGIN_SRC emacs-lisp
  (use-package dired
    :after evil-collection
    :ensure nil
    :commands (dired dired-jump)
    :custom
    (setq delete-by-moving-to-trash t)
    :config
    (evil-collection-define-key 'normal 'dired-mode-map
      "h" 'dired-up-directory
      "l" 'dired-find-file
      dired-listing-switches "-agho --group-directories-first"))

  (use-package dired-open
    :commands (dired dired-jump)
    :config
    (setq dired-open-extensions '(("png" . "feh")
                                  ("mkv" . "mpv"))))

  (use-package dired-hide-dotfiles
    :hook (dired-mode . dired-hide-dotfiles-mode)
    :config
    (evil-collection-define-key 'normal 'dired-mode-map "H" 'dired-hide-dotfiles-mode))
#+END_SRC

#+RESULTS:
| dired-hide-dotfiles-mode |

**** Org Bullets
#+BEGIN_SRC emacs-lisp
  (use-package org-bullets
    :defer t
    :hook (org-mode . org-bullets-mode)
    :custom
    (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))
#+END_SRC

#+RESULTS:
| #[0 \301\211\207 [imenu-create-index-function org-imenu-get-tree] 2] | malb/org-mode-visual-fill | org-bullets-mode | toc-org-enable | (lambda nil (display-line-numbers-mode 0)) | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-fold-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes |

**** Center Org Buffer
#+BEGIN_SRC emacs-lisp
  (defun malb/org-mode-visual-fill ()
    (setq visual-fill-column-width 150
          visual-fill-column-center-text t)
    (visual-fill-column-mode 1))

  (use-package visual-fill-column
    :hook (org-mode . malb/org-mode-visual-fill))
#+END_SRC

#+RESULTS:
| #[0 \301\211\207 [imenu-create-index-function org-imenu-get-tree] 2] | malb/org-mode-visual-fill | org-bullets-mode | toc-org-enable | (lambda nil (display-line-numbers-mode 0)) | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-fold-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes |

**** Corfu
#+BEGIN_SRC emacs-lisp
  ;; Configure corfu for company-mode completion.
  (use-package corfu
    :bind (:map corfu-map
                ("<tab>" . corfu-insert)
                ("C-q" . corfu-quit)
                ("C-j" . corfu-next)
                ("C-K" . corfu-previous)
                ("C-n" . corfu-popupinfo-scroll-down)
                ("C-p" . corfu-popupinfo-scroll-up))
    :init (global-corfu-mode) (corfu-popupinfo-mode)
    :custom
    (corfu-auto t)
    (corfu-auto-prefix 2)
    (corfu-auto-delay 0.15)

    (corfu-min-width 60)
    (corfu-max-width corfu-min-width)
    (corfu-count 14)
    (corfu-scroll-margin 4)
    (corfu-cycle nil)

    (corfu-quit-at-boundary nil)
    (corfu-preselect-first t)        ; Preselect first candidate?

    (completion-styles '(orderless basic)))

  (defun corfu-enable-always-in-minibuffer ()
    (unless (or (bound-and-true-p mct--active) ; Useful if I ever use MCT
                (bound-and-true-p vertico--input))
      (setq-local corfu-auto nil)       ; Ensure auto completion is disabled
      (corfu-mode 1)))
  (add-hook 'minibuffer-setup-hook #'corfu-enable-always-in-minibuffer 1)
#+END_SRC

#+RESULTS:
| marginalia--minibuffer-setup | rfn-eshadow-setup-minibuffer | minibuffer-error-initialize | minibuffer-history-isearch-setup | minibuffer-history-initialize | corfu-enable-always-in-minibuffer |

**** Marginalia
#+BEGIN_SRC emacs-lisp
  (use-package marginalia
    :custom
    (marginalia-max-relative-age 0)
    (marginalia-align 'right)
    :init
    (marginalia-mode))

  (use-package all-the-icons-completion
    :after (marginalia all-the-icons)
    :hook (marginalia-mode . all-the-icons-completion-marginalia-setup)
    :init
    (all-the-icons-completion-mode))
#+END_SRC

#+RESULTS:
| all-the-icons-completion-marginalia-setup |

*** Project Management
#+BEGIN_SRC emacs-lisp
  ;; Install and configure projectile for project management.
  (use-package projectile
    :diminish projectile-mode
    :init
    (projectile-mode +1))
  (setq projectile-indexing-method 'alien)
  (setq projectile-sort-order 'recently-active)
  (setq projectile-enable-caching t)
  (setq projectile-project-search-path '(("~/GitHub" . 2) ("C:/Users/Albertzard/Documents/Github". 2)))
#+END_SRC

#+RESULTS:
: ((~/GitHub . 2) (C:/Users/Albertzard/Documents/Github . 2))

